package com.app;

import java.util.Arrays;
import java.util.Map;
import java.util.stream.Collectors;

/**
 * user: donghai
 * date: 2017/7/7
 */
public class AdviewAppCat {

    static String mexCatString =
            "1\t爱好和活动\n" +
                    "2\t购物和时尚\n" +
                    "3\t健身与养生\n" +
                    "4\t科技\n" +
                    "5\t母婴\n" +
                    "6\t商业和工业\n" +
                    "7\t生活服务\n" +
                    "8\t食物和饮料\n" +
                    "9\t娱乐\n" +
                    "1001\t政治和社会事务\n" +
                    "1002\t艺术与音乐\n" +
                    "1003\t时事\n" +
                    "1004\t旅游\n" +
                    "1005\t交通工具\n" +
                    "1006\t家居和园艺\n" +
                    "1007\t活动\n" +
                    "1008\t宠物\n" +
                    "1009\t其他\n" +
                    "2001\t箱包\n" +
                    "2002\t线上购物\n" +
                    "2003\t玩具\n" +
                    "2004\t时尚饰品\n" +
                    "2005\t美容\n" +
                    "2006\t服装\n" +
                    "2007\t其他\n" +
                    "3001\t养生\n" +
                    "3002\t体育运动\n" +
                    "3003\t体育用品\n" +
                    "3004\t体育场馆\n" +
                    "3005\t健身\n" +
                    "3006\t其他\n" +
                    "4001\t应用工具\n" +
                    "4002\t消费电子产品\n" +
                    "4003\t消费产品\n" +
                    "4004\t电脑\n" +
                    "4005\t其他\n" +
                    "5001\t早教\n" +
                    "5002\t孕产\n" +
                    "5003\t婴幼\n" +
                    "5004\t母婴\n" +
                    "5005\t儿童\n" +
                    "5006\t其他\n" +
                    "6001\t制造业\n" +
                    "6002\t银行业\n" +
                    "6003\t物流行业\n" +
                    "6004\t市场营销\n" +
                    "6005\t设计\n" +
                    "6006\t商务\n" +
                    "6007\t农业\n" +
                    "6008\t贸易行业\n" +
                    "6009\t零售业\n" +
                    "6010\t林业\n" +
                    "6011\t科研行业\n" +
                    "6012\t经济行业\n" +
                    "6013\t教育行业\n" +
                    "6014\t建筑业\n" +
                    "6015\t互联网\n" +
                    "6016\t航空业\n" +
                    "6017\t广告业\n" +
                    "6018\t管理行业\n" +
                    "6019\t个人理财\n" +
                    "6020\t高等教育\n" +
                    "6021\t房地产\n" +
                    "6022\t其他\n" +
                    "7001\t天气\n" +
                    "7002\t生活服务\n" +
                    "7003\t房产服务\n" +
                    "7004\t宠物服务\n" +
                    "7005\t其他\n" +
                    "8001\t饮料\n" +
                    "8002\t食品\n" +
                    "8003\t美食\n" +
                    "9001\t阅读\n" +
                    "9002\t游戏\n" +
                    "9003\t媒体\n" +
                    "9004\t工艺品\n" +
                    "9005\t电影\n" +
                    "9006\t电视\n" +
                    "9007\t其他\n" +
                    "10010001\t政治\n" +
                    "10010002\t法律\n" +
                    "10010003\t军事\n" +
                    "10010004\t社区事物\n" +
                    "10020001\t摄影\n" +
                    "10020002\t表演\n" +
                    "10020003\t音乐\n" +
                    "10020004\t摄影\n" +
                    "10040001\t冒险旅游\n" +
                    "10040002\t酒店\n" +
                    "10040003\t旅游\n" +
                    "10050001\t微型车\n" +
                    "10050002\t小型车\n" +
                    "10050003\t紧凑型车\n" +
                    "10050004\t中型车\n" +
                    "10050005\t中大型车\n" +
                    "10050006\t豪华车\n" +
                    "10050007\tSUV\n" +
                    "10050008\tMPV\n" +
                    "10050009\t跑车\n" +
                    "10050010\t商用车\n" +
                    "10050011\t特种车辆\n" +
                    "10050012\t电动车\n" +
                    "10050013\t汽车服务\n" +
                    "10060001\t家具\n" +
                    "10060002\t家居装修\n" +
                    "10060003\t家用电器\n" +
                    "10060004\t园艺\n" +
                    "10080001\t宠物食品\n" +
                    "20040001\t太阳镜\n" +
                    "20040002\t珠宝\n" +
                    "20050001\t美发\n" +
                    "20050002\t化妆品\n" +
                    "20050003\t香水\n" +
                    "20050004\t美容院\n" +
                    "20050005\t温泉水疗\n" +
                    "20060001\t女装\n" +
                    "20060002\t男装\n" +
                    "20060003\t童装\n" +
                    "20060004\t鞋\n" +
                    "30010001\t药品\n" +
                    "30010002\t保健用品\n" +
                    "30010003\t医疗\n" +
                    "30010004\t体检机构\n" +
                    "40020001\t手机\n" +
                    "40020002\t便携式摄像机\n" +
                    "40020003\t游戏控制器\n" +
                    "40020004\t音频设备\n" +
                    "40020005\t平板电脑\n" +
                    "40020006\t数码配件\n" +
                    "40040001\t平板电脑\n" +
                    "40040002\t台式电脑\n" +
                    "40040003\t网络存储\n" +
                    "40040004\t电脑硬件\n" +
                    "50020001\t孕产用品\n" +
                    "50020002\t孕产营养\n" +
                    "50020003\t婴幼食品\n" +
                    "50020004\t婴幼用品\n" +
                    "60020001\t零售银行\n" +
                    "60050001\t平面设计\n" +
                    "60120001\t商业金融\n" +
                    "60150001\t安全\n" +
                    "60150002\t电商\n" +
                    "60150003\t通信\n" +
                    "60150004\t软件服务\n" +
                    "60150005\t社交\n" +
                    "60190001\t保险\n" +
                    "60190002\t抵押贷款\n" +
                    "60190003\t投资\n" +
                    "80010001\t软饮料\n" +
                    "80020004\t生鲜\n" +
                    "90010001\t书籍\n" +
                    "90010002\t非小说类书籍\n" +
                    "90010003\t杂志\n" +
                    "90010004\t电子书\n" +
                    "90020001\t网页游戏\n" +
                    "90020002\t在线游戏\n" +
                    "90020003\t电子游戏\n" +
                    "90020004\t牌类游戏\n" +
                    "90030001\t网络媒体\n" +
                    "90050001\t动漫";

    public static void main(String[] args) {
        Map<String, String> MexCatMap = Arrays.stream(mexCatString.split("\n")).map(i -> i.split("\t")).
                collect(Collectors.toMap(e -> e[1], e -> e[0]));


    }
}
